Tekla Open API Reference for Tekla Structures 2025
AnalysisBar.CardinalPoint Property
 Gets or sets the cardinal point of the analysis bar.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public AnalysisBar.CardinalPointEnum CardinalPoint { get; set; }
Public Property CardinalPoint As AnalysisBar.CardinalPointEnum
	Get
	Set
Property Value
Type: AnalysisBar.CardinalPointEnum
See Also
Reference
AnalysisBar Class
Tekla.Structures.Analysis Namespace